{
  "backend/main.mo": "Canister implementing access‑controlled user profiles and lead management with admin‑only lead retrieval and deletion.",
  "feature_evidence.json": "Feature evidence list mapping requested features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of key frontend pages, components, and configs.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and global base styles.",
  "frontend/index.html": "Base HTML entry file loading the React app and mounting it to the root div.",
  "frontend/src/App.tsx": "Configures TanStack Router and defines routes for all main site pages using SiteLayout as the root.",
  "frontend/src/components/conversion/StickyMobileCTA.tsx": "Mobile‑only bottom CTA bar with links to booking and WhatsApp using MARKETING_CONFIG.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing branding, navigation links, contact info, social links, and hours sourced from MARKETING_CONFIG.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with branding and navigation, including a collapsible mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Global layout wrapping pages with Header, Footer, and a mobile CTA bar.",
  "frontend/src/components/sections/LeadForm.tsx": "Form component for collecting lead info and submitting via useSubmitLead, with success UI and WhatsApp link.",
  "frontend/src/components/sections/LimitedTimeOfferBanner.tsx": "Promotional banner advertising a limited-time 50% discount with a call‑to‑action link.",
  "frontend/src/components/sections/MapEmbed.tsx": "Embeds a Google Maps iframe using marketing config values inside a styled card.",
  "frontend/src/components/sections/PlanComparisonTable.tsx": "Displays gym plan features in a table with desktop and mobile layouts, using icons for availability.",
  "frontend/src/components/sections/TrainerHighlights.tsx": "Shows a grid of coach highlight cards sourced from the COACHES config.",
  "frontend/src/components/seo/Seo.tsx": "Updates page title and meta description and injects structured JSON‑LD data for SEO.",
  "frontend/src/components/social/TestimonialsCarousel.tsx": "Carousel showcasing testimonial cards with ratings and user details.",
  "frontend/src/config/branding.ts": "Contains branding constants including logo path and company name.",
  "frontend/src/config/coaches.ts": "Defines the Coach interface and exports a list of coach profiles.",
  "frontend/src/config/marketing.ts": "Holds marketing details like contact info, maps embed URL, location, and working hours.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using Dfinity AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines a hook that fetches all leads via the backend actor using React Query, enabled once the actor is ready.",
  "frontend/src/hooks/useSubmitLead.ts": "Provides a mutation hook to submit a new lead through the actor and invalidates the leads query on success.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, dark mode settings, typography, and gold-themed utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata and content describing the gym's mission, vision, and benefits.",
  "frontend/src/pages/CafePage.tsx": "Displays the Fitness Café page with SEO data and sections describing nutrition concepts and menu categories.",
  "frontend/src/pages/ContactBookTrialPage.tsx": "Shows the contact and trial booking page with a lead form, contact info cards, map embed, and SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero, services, and promotional sections using marketing config and various UI components.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Displays membership plan tiers with pricing, features, and calls to action, including a popular highlighted plan.",
  "frontend/src/pages/ProgramsPage.tsx": "Shows an overview of available fitness programs with descriptions, feature lists, and links to contact.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters with fallback to sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Contains project metadata, feature requirements, known issues, and current state related to gym website updates."
}