{
  "backend/main.mo": "Motoko actor managing user profiles and lead submissions with permission checks using an access-control mixin.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of high-level summaries for major frontend components and pages.",
  "frontend/index.css": "Global Tailwind stylesheet defining CSS variables for light/dark themes and applying base foreground/background tokens.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all main pages wrapped in SiteLayout.",
  "frontend/src/components/conversion/StickyMobileCTA.tsx": "Mobile-only sticky CTA bar with buttons for booking a trial and WhatsApp contact.",
  "frontend/src/components/layout/Footer.tsx": "Global footer with brand info, navigation links, contact details, and social icons.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation, and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout wrapping pages with Header, Footer, and StickyMobileCTA.",
  "frontend/src/components/sections/LeadForm.tsx": "Interactive lead capture form that submits user details via a custom hook and displays success UI with WhatsApp CTA.",
  "frontend/src/components/sections/LimitedTimeOfferBanner.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/sections/MapEmbed.tsx": "Embeds a Google Maps iframe inside a styled card using marketing config values.",
  "frontend/src/components/sections/PlanComparisonTable.tsx": "Renders feature comparison tables for different membership plans with desktop and mobile layouts.",
  "frontend/src/components/sections/TrainerHighlights.tsx": "Displays a grid of coach highlight cards using data from the COACHES config.",
  "frontend/src/components/seo/Seo.tsx": "Sets document title and meta description and injects structured JSON-LD data for SEO.",
  "frontend/src/components/social/TestimonialsCarousel.tsx": "Carousel component showing user testimonials with ratings and profile details.",
  "frontend/src/config/branding.ts": "Provides centralized branding constants including logo path and company name.",
  "frontend/src/config/coaches.ts": "Defines coach interface and exports a list of coaches with specialties and experience.",
  "frontend/src/config/marketing.ts": "Holds marketing and location configuration including contact info, maps embed URL, and working hours.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading stored identities and handling login state.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that fetches all leads from the backend actor when available.",
  "frontend/src/hooks/useSubmitLead.ts": "Defines a mutation hook to submit a new lead via the actor and refresh the leads list on success.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, typography, utilities, and custom accent classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and value sections using marketing config and styled UI components.",
  "frontend/src/pages/CafePage.tsx": "Renders the Café page featuring nutrition concept details and menu categories with styled cards.",
  "frontend/src/pages/ContactBookTrialPage.tsx": "Renders the contact and free trial booking page with a lead form, contact details, and embedded map.",
  "frontend/src/pages/HomePage.tsx": "React page rendering the marketing homepage with hero, services, testimonials, and SEO metadata.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Displays gym membership plans with pricing tiers, feature lists, and SEO configuration.",
  "frontend/src/pages/ProgramsPage.tsx": "Shows detailed fitness program offerings such as strength training and weight loss with descriptions and SEO.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Metadata describing project state, existing features, and pending requests for global white text styling."
}