{
  "backend/main.mo": "Motoko actor managing user profiles and lead submissions with admin/user access control using AccessControl and MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing location‑update tasks, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries describing the purpose of various frontend components and pages.",
  "frontend/index.css": "Tailwind CSS setup defining global design tokens, light/dark theme variables, and base styles.",
  "frontend/index.html": "Base HTML document loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for all pages and renders RouterProvider.",
  "frontend/src/components/conversion/StickyMobileCTA.tsx": "Mobile-only bottom CTA bar linking to contact and WhatsApp using MARKETING_CONFIG.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing branding, navigation links, contact info from MARKETING_CONFIG, and social icons.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, desktop/mobile navigation, and active route highlighting.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper composing Header, Footer, main content Outlet, and mobile CTA.",
  "frontend/src/components/sections/LeadForm.tsx": "A lead capture form that collects user contact details and submits them via a custom hook, showing success UI after submission.",
  "frontend/src/components/sections/LimitedTimeOfferBanner.tsx": "File is empty or contains no implementation.",
  "frontend/src/components/sections/MapEmbed.tsx": "Embeds a Google Maps iframe inside a styled card using marketing config values.",
  "frontend/src/components/sections/PlanComparisonTable.tsx": "Displays a comparison table of gym membership plans with feature availability for desktop and mobile views.",
  "frontend/src/components/sections/TrainerHighlights.tsx": "Shows a grid of trainer cards using coach data, highlighting specialties and experience.",
  "frontend/src/components/seo/Seo.tsx": "Updates document metadata and injects structured JSON-LD for SEO using branding and marketing config.",
  "frontend/src/components/social/TestimonialsCarousel.tsx": "A carousel displaying user testimonials with ratings, avatars, and text.",
  "frontend/src/config/branding.ts": "Defines static branding data including logo path and company name.",
  "frontend/src/config/coaches.ts": "Exports coach interface and a list of coach profiles with specialties and experience.",
  "frontend/src/config/marketing.ts": "Contains marketing-related configuration such as contact details, maps URL, location info, and working hours.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor using identity, with query caching and access control initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading stored identities and handling login state.",
  "frontend/src/hooks/useQueries.ts": "Defines a hook that fetches all leads using a backend actor with React Query.",
  "frontend/src/hooks/useSubmitLead.ts": "Defines a mutation hook to submit a lead and invalidate the leads list when successful.",
  "frontend/src/index.css": "Tailwind CSS setup including custom color variables, typography tweaks, and accessibility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and reasons to choose the gym, using marketing config and UI components.",
  "frontend/src/pages/CafePage.tsx": "Displays the Fitness Café page with nutrition concept details and menu category sections.",
  "frontend/src/pages/ContactBookTrialPage.tsx": "Renders the contact and free trial booking page with a lead form, contact details, and location info.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing-focused home page with hero, services, testimonials, trainer highlights, and SEO metadata using MARKETING_CONFIG.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Displays membership pricing tiers with plan details, comparison table, and SEO metadata.",
  "frontend/src/pages/ProgramsPage.tsx": "Shows detailed descriptions of fitness programs with icons, benefits, and contact CTAs plus SEO metadata.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and plugins for the frontend theme.",
  "project_state.json": "Tracks project metadata, feature requests, and state for updating location and contact information to Kekri."
}