{
  "kind": "build_request",
  "title": "Update all site location/contact copy and map to Kekri (replace Mumbai)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update all user-facing location text across the frontend to reflect the Kekri, Rajasthan location instead of Mumbai, including the “Visit Us” section copy, page SEO titles/descriptions, and any other hardcoded mentions of “Mumbai”, the Mumbai address, or the old phone number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "change the discription: Visit Us in Kekri",
          "yes all are update for kekri location"
        ]
      },
      "acceptanceCriteria": [
        "No page in the UI displays the words “Mumbai” or the old Mumbai address (“123 Fitness Street, Mumbai, Maharashtra 400001, India”).",
        "About page ‘Visit Us’ section displays: ‘Visit Us in Kekri’ and the Kekri address provided by the user (1st Floor K.J Tower Above B.O.B Bank Ajmer Road Kekri, Kekri, Rajasthan).",
        "Any phone number shown in the UI is consistent with the location update and does not show the old number +91 98765 43210 unless it is the configured number for Kekri.",
        "SEO titles/descriptions on pages that currently reference Mumbai are updated to reference Kekri (preferably using MARKETING_CONFIG.location.displayName/fullLocation rather than hardcoded city strings)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Kekri address/contact information and map embed are sourced from the shared marketing configuration so that Footer, Contact page, map embed, and any ‘Visit Us’ blocks stay consistent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "yes all are update for kekri location",
          "apply"
        ]
      },
      "acceptanceCriteria": [
        "About page ‘Visit Us’ section uses MARKETING_CONFIG fields (address/city/state/country/phone/phoneFormatted) instead of hardcoded Mumbai strings.",
        "Footer contact block continues to render from MARKETING_CONFIG and shows the Kekri address.",
        "Contact page address card and phone link render the Kekri details from MARKETING_CONFIG.",
        "Map iframe uses MARKETING_CONFIG.googleMapsEmbedUrl and the iframe title references Kekri via MARKETING_CONFIG.location.fullLocation."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update MARKETING_CONFIG to match the user-provided Kekri location details (Visit Us in Kekri; 1st Floor K.J Tower Above B.O.B Bank Ajmer Road Kekri; Kekri, Rajasthan) and ensure the configured phone number matches the intended contact number for the updated location.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "Visit Us in Kekri\n1st Floor K.J Tower Above B.O.B Bank Ajmer Road Kekri\nKekri, Rajasthan",
          "yes all are update for kekri location"
        ]
      },
      "acceptanceCriteria": [
        "MARKETING_CONFIG.address/city/state/country reflect the Kekri address provided by the user.",
        "All tel: links and displayed phone formatting across the site match the phone configured in MARKETING_CONFIG.",
        "No remaining components/pages display a different address than MARKETING_CONFIG."
      ]
    }
  ],
  "constraints": [
    "Frontend immutablePaths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Keep backend as a single Motoko actor; no backend changes are required for this location update."
  ],
  "nonGoals": [
    "Adding new pages or new features unrelated to the location/contact update.",
    "Changing branding, pricing, trainers, or program offerings.",
    "Implementing third-party integrations beyond the existing Google Maps embed URL usage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}