{
  "kind": "build_request",
  "title": "Change all text across the app to white (global font color)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Set the global default text color to pure white across the entire React app by updating the Tailwind color tokens so that `text-foreground` renders white in both light and dark modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-8"
        ],
        "quotes": [
          "change to colour of all font to white",
          "apply"
        ]
      },
      "acceptanceCriteria": [
        "All pages (Home, About, Programs, Café, Membership, Contact) render default body text in white without requiring per-component changes.",
        "In both light and dark mode, `body` continues to use `@apply ... text-foreground`, and the resolved `foreground` color is white.",
        "No regressions to layout/spacing occur as a result of the color token changes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure all user-visible text remains white even where components currently apply explicit non-white text utility classes (e.g., `text-muted-foreground`, `text-primary`, `hover:text-primary`, `text-green-accent`, `text-gold`), including interactive states such as hover and focus.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7"
        ],
        "quotes": [
          "change to colour of all font to white"
        ]
      },
      "acceptanceCriteria": [
        "Navigation labels in the header remain white in normal, active, and hover states.",
        "Footer link text and footer meta text remain white in normal and hover states, and icons/text that were previously yellow accent (e.g., `text-primary`) are updated to white.",
        "Text in CTA areas (buttons, banners, forms) remains white unless the text is part of a non-text graphic (e.g., an image)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply the same white-foreground token update consistently in all active global stylesheet entrypoints used by the frontend build (including both `frontend/src/index.css` and `frontend/index.css` if the project still ships both), so there is no environment-dependent mismatch in text color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-8"
        ],
        "quotes": [
          "apply"
        ]
      },
      "acceptanceCriteria": [
        "The app renders white text consistently in local dev and production builds.",
        "There is a single, consistent source of truth for the white foreground token across global CSS files used by the build."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose them instead of editing).",
    "Do not edit immutable auth/actor bootstrap hooks: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, and `frontend/src/main.tsx`.",
    "Backend remains single-actor Motoko; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Changing background colors, button background colors, or the overall yellow branding theme (beyond making text white).",
    "Adding new pages, routes, or features unrelated to text color.",
    "Any backend schema/state changes or migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}