{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Global white text across the React app via Tailwind foreground tokens",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make `text-foreground` resolve to pure white in both light and dark modes via Tailwind CSS variable tokens.",
      "acceptanceCriteria": [
        "All pages (Home, About, Programs, Café, Membership, Contact) render default body text in white without requiring per-component changes.",
        "In both light and dark mode, `body` continues to use `@apply ... text-foreground`, and the resolved `foreground` color is white.",
        "No regressions to layout/spacing occur as a result of the color token changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the global theme CSS variables so `--foreground` is pure white in both `:root` (light) and `.dark` (dark), ensuring `text-foreground` renders white while `body` still uses `@apply bg-background text-foreground`."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure all user-visible text stays white even where explicit non-white Tailwind text utilities and interactive states are currently used.",
      "acceptanceCriteria": [
        "Navigation labels in the header remain white in normal, active, and hover states.",
        "Footer link text and footer meta text remain white in normal and hover states, and icons/text that were previously yellow accent (e.g., `text-primary`) are updated to white.",
        "Text in CTA areas (buttons, banners, forms) remains white unless the text is part of a non-text graphic (e.g., an image)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust supporting color tokens and custom utility mappings so common text variants remain white (e.g., set `--muted-foreground` to white and remap custom `.text-green-accent` / `.text-gold` utilities to use the foreground token), including preserving white selection text."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Update header navigation button classes so labels remain white in normal/active/hover states (e.g., replace `hover:text-primary` behavior with a white/foreground-consistent hover state while keeping existing layout/spacing)."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Update footer text/link/icon classes so all footer copy stays white in normal and hover states (replace uses of `text-muted-foreground`, `hover:text-primary`, and `text-primary` on inline icon/link text with white/foreground-consistent classes)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update Home page explicit non-white text utilities so user-visible text (including highlighted words and CTA button labels currently using accent or black text) renders white, while keeping existing backgrounds/branding and layout intact."
        },
        {
          "path": "frontend/src/components/sections/LeadForm.tsx",
          "operation": "modify",
          "description": "Update LeadForm success/CTA/help text classes so any explicit `text-muted-foreground`/accent text stays white (including informational and helper copy), without altering form layout/spacing."
        },
        {
          "path": "frontend/src/components/conversion/StickyMobileCTA.tsx",
          "operation": "modify",
          "description": "Ensure StickyMobileCTA button and outline/hover text classes remain white in default and interactive states (hover/focus), without changing button backgrounds or spacing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply the white-foreground token update consistently across all active global stylesheet entrypoints used by the frontend build to avoid environment-dependent mismatches.",
      "acceptanceCriteria": [
        "The app renders white text consistently in local dev and production builds.",
        "There is a single, consistent source of truth for the white foreground token across global CSS files used by the build."
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Align the legacy/global CSS variable tokens with the active app theme so `text-foreground` resolves to pure white in both light and dark modes, avoiding dev/prod mismatches if this stylesheet is still included in any build path."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Confirm the canonical token definitions (including pure-white `--foreground`) are present and consistent in the primary stylesheet imported by the app, and document/organize variables to serve as the single source of truth across global CSS entrypoints."
        }
      ]
    }
  ]
}